/* automatically generated by rust-bindgen 0.60.1 */

pub const GLFW_VERSION_MAJOR: u32 = 3;
pub const GLFW_VERSION_MINOR: u32 = 2;
pub const GLFW_VERSION_REVISION: u32 = 1;
pub const GLFW_TRUE: u32 = 1;
pub const GLFW_FALSE: u32 = 0;
pub const GLFW_RELEASE: u32 = 0;
pub const GLFW_PRESS: u32 = 1;
pub const GLFW_REPEAT: u32 = 2;
pub const GLFW_KEY_UNKNOWN: i32 = -1;
pub const GLFW_KEY_SPACE: u32 = 32;
pub const GLFW_KEY_APOSTROPHE: u32 = 39;
pub const GLFW_KEY_COMMA: u32 = 44;
pub const GLFW_KEY_MINUS: u32 = 45;
pub const GLFW_KEY_PERIOD: u32 = 46;
pub const GLFW_KEY_SLASH: u32 = 47;
pub const GLFW_KEY_0: u32 = 48;
pub const GLFW_KEY_1: u32 = 49;
pub const GLFW_KEY_2: u32 = 50;
pub const GLFW_KEY_3: u32 = 51;
pub const GLFW_KEY_4: u32 = 52;
pub const GLFW_KEY_5: u32 = 53;
pub const GLFW_KEY_6: u32 = 54;
pub const GLFW_KEY_7: u32 = 55;
pub const GLFW_KEY_8: u32 = 56;
pub const GLFW_KEY_9: u32 = 57;
pub const GLFW_KEY_SEMICOLON: u32 = 59;
pub const GLFW_KEY_EQUAL: u32 = 61;
pub const GLFW_KEY_A: u32 = 65;
pub const GLFW_KEY_B: u32 = 66;
pub const GLFW_KEY_C: u32 = 67;
pub const GLFW_KEY_D: u32 = 68;
pub const GLFW_KEY_E: u32 = 69;
pub const GLFW_KEY_F: u32 = 70;
pub const GLFW_KEY_G: u32 = 71;
pub const GLFW_KEY_H: u32 = 72;
pub const GLFW_KEY_I: u32 = 73;
pub const GLFW_KEY_J: u32 = 74;
pub const GLFW_KEY_K: u32 = 75;
pub const GLFW_KEY_L: u32 = 76;
pub const GLFW_KEY_M: u32 = 77;
pub const GLFW_KEY_N: u32 = 78;
pub const GLFW_KEY_O: u32 = 79;
pub const GLFW_KEY_P: u32 = 80;

#[doc = "  @param[in] paths The UTF-8 encoded file and/or directory path names."]
#[doc = ""]
#[doc = "  @sa @ref path_drop"]
#[doc = "  @sa glfwSetDropCallback"]
#[doc = ""]
#[doc = "  @since Added in version 3.1."]
#[doc = ""]
#[doc = "  @ingroup input"]
pub type GLFWdropfun = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut GLFWwindow,
        arg2: ::std::os::raw::c_int,
        arg3: *mut *const ::std::os::raw::c_char,
    ),
>;
#[doc = " @brief The function signature for monitor configuration callbacks."]
#[doc = ""]
#[doc = "  This is the function signature for monitor configuration callback functions."]
#[doc = ""]
#[doc = "  @param[in] monitor The monitor that was connected or disconnected."]
#[doc = "  @param[in] event One of `GLFW_CONNECTED` or `GLFW_DISCONNECTED`."]
#[doc = ""]
#[doc = "  @sa @ref monitor_event"]
#[doc = "  @sa glfwSetMonitorCallback"]
#[doc = ""]
#[doc = "  @since Added in version 3.0."]
#[doc = ""]
#[doc = "  @ingroup monitor"]
pub type GLFWmonitorfun = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut GLFWmonitor, arg2: ::std::os::raw::c_int),
>;
#[doc = " @brief The function signature for joystick configuration callbacks."]
#[doc = ""]
#[doc = "  This is the function signature for joystick configuration callback"]
#[doc = "  functions."]
#[doc = ""]
#[doc = "  @param[in] joy The joystick that was connected or disconnected."]
#[doc = "  @param[in] event One of `GLFW_CONNECTED` or `GLFW_DISCONNECTED`."]
#[doc = ""]
#[doc = "  @sa @ref joystick_event"]
#[doc = "  @sa glfwSetJoystickCallback"]
#[doc = ""]
#[doc = "  @since Added in version 3.2."]
#[doc = ""]
#[doc = "  @ingroup input"]
pub type GLFWjoystickfun = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int),
>;
#[doc = " @brief Video mode type."]
#[doc = ""]
#[doc = "  This describes a single video mode."]
#[doc = ""]
#[doc = "  @sa @ref monitor_modes"]
#[doc = "  @sa glfwGetVideoMode glfwGetVideoModes"]
#[doc = ""]
#[doc = "  @since Added in version 1.0."]
#[doc = "  @glfw3 Added refresh rate member."]
#[doc = ""]
#[doc = "  @ingroup monitor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWvidmode {
    #[doc = " The width, in screen coordinates, of the video mode."]
    pub width: ::std::os::raw::c_int,
    #[doc = " The height, in screen coordinates, of the video mode."]
    pub height: ::std::os::raw::c_int,
    #[doc = " The bit depth of the red channel of the video mode."]
    pub redBits: ::std::os::raw::c_int,
    #[doc = " The bit depth of the green channel of the video mode."]
    pub greenBits: ::std::os::raw::c_int,
    #[doc = " The bit depth of the blue channel of the video mode."]
    pub blueBits: ::std::os::raw::c_int,
    #[doc = " The refresh rate, in Hz, of the video mode."]
    pub refreshRate: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_GLFWvidmode() {
    assert_eq!(
        ::std::mem::size_of::<GLFWvidmode>(),
        24usize,
        concat!("Size of: ", stringify!(GLFWvidmode))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWvidmode>(),
        4usize,
        concat!("Alignment of ", stringify!(GLFWvidmode))
    );
    fn test_field_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWvidmode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWvidmode),
                "::",
                stringify!(width)
            )
        );
    }
    test_field_width();
    fn test_field_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWvidmode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWvidmode),
                "::",
                stringify!(height)
            )
        );
    }
    test_field_height();
    fn test_field_redBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWvidmode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).redBits) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWvidmode),
                "::",
                stringify!(redBits)
            )
        );
    }
    test_field_redBits();
    fn test_field_greenBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWvidmode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).greenBits) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWvidmode),
                "::",
                stringify!(greenBits)
            )
        );
    }
    test_field_greenBits();
    fn test_field_blueBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWvidmode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).blueBits) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWvidmode),
                "::",
                stringify!(blueBits)
            )
        );
    }
    test_field_blueBits();
    fn test_field_refreshRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWvidmode>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refreshRate) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWvidmode),
                "::",
                stringify!(refreshRate)
            )
        );
    }
    test_field_refreshRate();
}
#[doc = " @brief Gamma ramp."]
#[doc = ""]
#[doc = "  This describes the gamma ramp for a monitor."]
#[doc = ""]
#[doc = "  @sa @ref monitor_gamma"]
#[doc = "  @sa glfwGetGammaRamp glfwSetGammaRamp"]
#[doc = ""]
#[doc = "  @since Added in version 3.0."]
#[doc = ""]
#[doc = "  @ingroup monitor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWgammaramp {
    #[doc = " An array of value describing the response of the red channel."]
    pub red: *mut ::std::os::raw::c_ushort,
    #[doc = " An array of value describing the response of the green channel."]
    pub green: *mut ::std::os::raw::c_ushort,
    #[doc = " An array of value describing the response of the blue channel."]
    pub blue: *mut ::std::os::raw::c_ushort,
    #[doc = " The number of elements in each array."]
    pub size: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GLFWgammaramp() {
    assert_eq!(
        ::std::mem::size_of::<GLFWgammaramp>(),
        32usize,
        concat!("Size of: ", stringify!(GLFWgammaramp))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWgammaramp>(),
        8usize,
        concat!("Alignment of ", stringify!(GLFWgammaramp))
    );
    fn test_field_red() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWgammaramp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).red) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWgammaramp),
                "::",
                stringify!(red)
            )
        );
    }
    test_field_red();
    fn test_field_green() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWgammaramp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).green) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWgammaramp),
                "::",
                stringify!(green)
            )
        );
    }
    test_field_green();
    fn test_field_blue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWgammaramp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).blue) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWgammaramp),
                "::",
                stringify!(blue)
            )
        );
    }
    test_field_blue();
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWgammaramp>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWgammaramp),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
}
#[doc = " @brief Image data."]
#[doc = ""]
#[doc = "  @sa @ref cursor_custom"]
#[doc = "  @sa @ref window_icon"]
#[doc = ""]
#[doc = "  @since Added in version 2.1."]
#[doc = "  @glfw3 Removed format and bytes-per-pixel members."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWimage {
    #[doc = " The width, in pixels, of this image."]
    pub width: ::std::os::raw::c_int,
    #[doc = " The height, in pixels, of this image."]
    pub height: ::std::os::raw::c_int,
    #[doc = " The pixel data of this image, arranged left-to-right, top-to-bottom."]
    pub pixels: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_GLFWimage() {
    assert_eq!(
        ::std::mem::size_of::<GLFWimage>(),
        16usize,
        concat!("Size of: ", stringify!(GLFWimage))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWimage>(),
        8usize,
        concat!("Alignment of ", stringify!(GLFWimage))
    );
    fn test_field_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWimage>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWimage),
                "::",
                stringify!(width)
            )
        );
    }
    test_field_width();
    fn test_field_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWimage>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWimage),
                "::",
                stringify!(height)
            )
        );
    }
    test_field_height();
    fn test_field_pixels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<GLFWimage>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pixels) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(GLFWimage),
                "::",
                stringify!(pixels)
            )
        );
    }
    test_field_pixels();
}
extern "C" {
    #[doc = " @brief Initializes the GLFW library."]
    #[doc = ""]
    #[doc = "  This function initializes the GLFW library.  Before most GLFW functions can"]
    #[doc = "  be used, GLFW must be initialized, and before an application terminates GLFW"]
    #[doc = "  should be terminated in order to free any resources allocated during or"]
    #[doc = "  after initialization."]
    #[doc = ""]
    #[doc = "  If this function fails, it calls @ref glfwTerminate before returning.  If it"]
    #[doc = "  succeeds, you should call @ref glfwTerminate before the application exits."]
    #[doc = ""]
    #[doc = "  Additional calls to this function after successful initialization but before"]
    #[doc = "  termination will return `GLFW_TRUE` immediately."]
    #[doc = ""]
